Repository: mrjimmybob/EncDecFile
Catalog: EncDecFile/Language/strings.*.resx
Languages: de, es

source: Action
de: Aktion
es: Acción

# automatic_detection
source: Automatic detection (not reliable)
de: Automatische Erkennung (nicht zuverlässig)
es: Detección automática (menos fiable)

# a_opt_desc
source: Auto encrypt or decrypt filename
de: Dateinamen automatisch verschlüsseln oder entschlüsseln
es: Auto encripta o desencripta el contenido del fichero

# a_opt_desc2
source: If filename is encrypted it is decrypted, and if it is plain text it is encrypted
de: Wenn der Dateiname verschlüsselt ist, wird er entschlüsselt, und wenn es sich um Klartext handelt, wird er verschlüsselt
es: Si el contenido del fichero de configuración está encriptada, se desencripta y viceversa

source: Created output file
de: Erstellte Ausgabedatei
es: Creado el fichero de salida

source: Decrypted
de: Entschlüsselt
es: Desencriptado

source: Decrypted String
de: Entschlüsselte Zeichenfolge
es: Cadena desencriptada

source: Decrypting
de: Entschlüsselung
es: Desencriptando

# d_opt_desc
source: Decrypts config file filename
de: Entschlüsselt Konfigurationsdatei Dateiname
es: Desencripta el fichero de configuración

source: Encrypted
de: Verschlüsselt
es: Encriptado

source: Encrypted String
de: Verschlüsselte Zeichenfolge
es: Cadena encriptada

source: Encrypting
de: Verschlüsseln
es: Encriptando

source: Error creating output file
de: Fehler beim Erstellen der Ausgabedatei
es: Error creando el fichero de salida

source: Error processing file
de: Fehler bei der Verarbeitung der Datei
es: Error procesando fichero

# e_opt_desc
source: Encrypts config file filename
de: Verschlüsselt den Dateinamen der Konfigurationsdatei
es: Encripta el fichero de configuración

source: filename
de: Dateiname
es: fichero

source: File does not exist
de: Datei existiert nicht
es: El fichero no existe

source: Finished processing file
de: Fertige Verarbeitungsdatei
es: Se ha terminado de procesar el fichero

source: Finished processing string
de: Fertige Verarbeitungszeichenfolge
es: Se terminó de procesar la cadena

source: From a total of
de: Von insgesamt
es: De un total de

source: Input file
de: Eingabedatei
es: Fichero de entrada

# need_to_be_group_gudepssii
source: You need to be part of the gudepssii to run this programme
de: Sie müssen Teil der gudepssii sein, um dieses Programm auszuführen
es: Debes pertenecer al grupo gudepssii para ejecutar este programa

source: Options
de: Optionen
es: Opciones

source: outputfile
de: Ausgabedatei
es: ficherosalida

source: Output File:
de: Ausgabedatei:

# output_file_already_exists
source: Output file already exists, aborting
de: Die Ausgabedatei ist bereits vorhanden. Der Vorgang wird abgebrochen.
es: El fichero de salida ya existe, abortando

# o_opt_desc
source: Write output to outputfile
de: Ausgabe in Ausgabedatei schreiben
es: Escribir la salida al fichero de salida

# o_opt_desc2
source: If no outputfile is given with -o, the output file will be auto named
de: Wenn mit -o keine Ausgabedatei angegeben wird, wird die Ausgabedatei automatisch benannt
es: Si no se da un nombre de fichero con -o, se nombra automáticamente

source: Parameter error
de: Parameterfehler
es: Error de parámetros

source: Path is a directory, should be a filename
de: Pfad ist ein Verzeichnis, sollte ein Dateiname sein
es: La ruta es un directorio, debería ser un fichero

source: Permision denied
de: Zugriff verweigert
es: Permiso denegado

source: Processing
de: Verarbeitung
es: Procesando

source: string
de: Schnur
es: cadena

# s_opt_desc
source: Encrypt and Decrypt string, print output to standard output
de: Zeichenfolge verschlüsseln und entschlüsseln, Ausgabe auf Standardausgabe drucken
es: Encripta o desencripta una cadena de caracteres e imprime en la salida estándar

# tried_decrypt
source: Tried to decrypt non encrypted
de: Versucht, nicht verschlüsselte zu entschlüsseln
es: Intentado desencriptar no encriptado

source: Unspecified error processing file
de: Nicht angegebener Fehler bei der Dateiverarbeitung
es: Error no especificado procesando el fichero

source: Usage
de: Verwendung
es: Uso

source: with errors
de: mit Fehlern
es: con errores

source: in
es: en
